Revit 2027 API
MEPNetworkSegmentId.SegmentId Property
 The segment identifier.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SegmentId { get; set; }
Public Property SegmentId As Integer
	Get
	Set
public:
property int SegmentId {
	int get ();
	void set (int value);
}
member SegmentId : int with get, set
Property Value
Int32
See Also
Reference
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace